Revit 2024 API
FilterCategoryRule Class
 A filter rule that matches elements of a set of categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class FilterCategoryRule : FilterRule
Visual Basic
Public Class FilterCategoryRule _
	Inherits FilterRule
Visual C++
public ref class FilterCategoryRule : public FilterRule
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterCategoryRule
See Also
FilterCategoryRule Members
Autodesk.Revit.DB Namespace